NAT 

Router 3:

Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface GigabitEthernet0/2
Router(config-if)#ip nat outside
Router(config-if)#exit


Router(config)#interface Serial0/3/1
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#interface Serial0/3/0
Router(config-if)#ip nat outside 
Router(config-if)#exit

Router2:

Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface GigabitEthernet0/2
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#interface Serial0/3/1
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#interface Serial0/3/0
Router(config-if)#ip nat outside

Router 4:

Router(config)#interface FastEthernet0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface FastEthernet0/1
Router(config-if)#ip nat outside
Router(config-if)#exit

Router 5:

Router(config)#interface FastEthernet0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#interface FastEthernet0/1
Router(config-if)#ip nat outside
Router(config-if)#exit

RIP

Router 0:

Router(config)#router rip
Router(config-router)#network 10.10.8.0
Router(config-router)#network 10.10.16.0
Router(config-router)#network 172.17.2.0
Router(config-router)#exit

Router 2:

Router(config)#router rip
Router(config-router)#network 10.10.12.0
Router(config-router)#network 10.10.16.0
Router(config-router)#network 172.17.2.0
Router(config-router)#exit

Router 3:

Router(config)#router rip
Router(config-router)#network 10.10.0.0
Router(config-router)#network 10.10.16.0
Router(config-router)#network 172.17.2.0